# ApplicableTotalLengthRounding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarRoundingManager..::..ApplicableTotalLengthRounding Property
RebarRoundingManager Class See Also
---
The applicable rounding for Bar Length and Total Bar Length parameters.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ApplicableTotalLengthRounding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableTotalLengthRounding As Double
	Get
```

Visual C++
---
```text
public:
property double ApplicableTotalLengthRounding {
	double get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableTotalLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
# See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace